/*! \mainpage notitle
 *
 * \section intro_sec О приложении
 *
 * Это программу для просмотра 3D моделей в каркасном виде (3D Viewer). 
 * Сами модели необходимо загружать из файлов формата .obj. 
 * Реализована возможность просматривать модели на экране с возможностью вращения, 
 * масштабирования и перемещения. Приложение представляет собой проявление 3D модели.
 *
 * \subsection step1 Основные функции
 *
 * - OpenFile -             загрузка модели .obj;
 * - Move by axis -         перемещение модели по осям x/y/z;
 * - Rotate By Angle -      поворот модели по осям x/y/z;
 * - Resize -               изменение размера модели;
 * - Lines -                изменения цвета линий, ее типа и размера;
 * - Point -                изменение цвета точек, их типа и размера;
 * - Background -           изменение цвет фона;
 * - Change Projection -    переключение проекций;
 * - Clean -                очистка настроек;
 *
 * \subsection step2 Дополнительные функции:
 *
 * - Start Gif -            cтарт записи  Gif;
 * - Save Gif -             остановка и сохраниение  Gif;
 * - Save setting -         сохранение настроек;
 * - Load setting -         загрузка настроек;
 * - Take Screenshot -      скриншот;
 *
 */
