/*! \mainpage notitle
 *
 * \section intro_sec О приложении
 *
 * Приложение представляет собой калькулятор, способный отрисовывать график
 * функций и поддерживающий:
 *
 * \subsection step1 Арифметические операторы:
 *
 * - "( )" - скобки;
 * - "+" - сложение;
 * - "-" - вычитание;
 * - "*" - умножение;
 * - "/" - деление;
 * - "^" - возведение в степень;
 * - "mod" - остаток от деления;
 * - +a - унарный плюс;
 * - -a - унарный минус;
 *
 * \subsection step2 Функции:
 *
 * - "cos(x)" - вычисление косинуса;
 * - "sin(x)" - вычисление синуса;
 * - "tan(x)" - вычисление тангенса;
 * - "acos(x)" - вычисление арккосинус;
 * - "asin(x)" - вычисление арксинуса;
 * - "atan(x)" - вычисление арктангенса;
 * - "sqrt(x)" - вычисление квадратного корня;
 * - "ln(x)" - вычисление натурального логарифма;
 * - "log(x)" - вычисление десятичного логарифм.
 *
 */
